SiliconLabs/arduino/boards.txt
nano_matter.menu.protocol_stack.none.build.ld_libs=-lstdc++ -lgcc -lc -lm -lnosys -lsupc++

### BLE (Arduino) build flags
#############################
nano_matter.menu.protocol_stack.ble_arduino.build.c_flags=-mcpu={build.mcu} -mthumb -mfpu=fpv5-sp-d16 -mfloat-abi=hard -c -g {compiler.warning_flags} {build.float_flags} -std=c18 -Wall -Wextra -fdata-sections -ffunction-sections -fomit-frame-pointer -imacros sl_gcc_preinclude.h -mcmse --specs=nano.specs -g -Wno-unused-parameter

nano_matter.menu.protocol_stack.ble_arduino.build.cpp_flags=-mcpu={build.mcu} -mthumb -mfpu=fpv5-sp-d16 -mfloat-abi=hard -c -g {compiler.warning_flags} {build.float_flags} -std=gnu++17 -Wall -Wextra -fdata-sections -ffunction-sections -fomit-frame-pointer -imacros sl_gcc_preinclude.h -mcmse --specs=nano.specs -g -fno-exceptions -Wno-unused-parameter

nano_matter.menu.protocol_stack.ble_arduino.build.ld_flags=-mcpu={build.mcu} -mthumb -mfpu=fpv5-sp-d16 -mfloat-abi=hard --specs=nano.specs -Xlinker -Map {compiler.mapfile_path} -Wl,--gc-sections -Wl,--wrap=_free_r -Wl,--wrap=_malloc_r -Wl,--wrap=_calloc_r -Wl,--wrap=_realloc_r

nano_matter.menu.protocol_stack.ble_arduino.build.ld_libs=-lstdc++ -lgcc -lc -lm -lnosys -lsupc++

### BLE (Silabs) build flags
############################
nano_matter.menu.protocol_stack.ble_silabs.build.c_flags=-mcpu={build.mcu} -mthumb -mfpu=fpv5-sp-d16 -mfloat-abi=hard -c -g {compiler.warning_flags} {build.float_flags} -std=c18 -Wall -Wextra -fdata-sections -ffunction-sections -fomit-frame-pointer -imacros sl_gcc_preinclude.h -mcmse --specs=nano.specs -g -Wno-unused-parameter

nano_matter.menu.protocol_stack.ble_silabs.build.cpp_flags=-mcpu={build.mcu} -mthumb -mfpu=fpv5-sp-d16 -mfloat-abi=hard -c -g {compiler.warning_flags} {build.float_flags} -std=gnu++17 -Wall -Wextra -fdata-sections -ffunction-sections -fomit-frame-pointer -imacros sl_gcc_preinclude.h -mcmse --specs=nano.specs -g -fno-exceptions -Wno-unused-parameter

nano_matter.menu.protocol_stack.ble_silabs.build.ld_flags=-mcpu={build.mcu} -mthumb -mfpu=fpv5-sp-d16 -mfloat-abi=hard --specs=nano.specs -Xlinker -Map {compiler.mapfile_path}  -Wl,--gc-sections -Wl,--wrap=_free_r -Wl,--wrap=_malloc_r -Wl,--wrap=_calloc_r -Wl,--wrap=_realloc_r -flto=auto

nano_matter.menu.protocol_stack.ble_silabs.build.ld_libs=-lstdc++ -lgcc -lc -lm -lnosys -lsupc++

### Matter build flags
######################
nano_matter.menu.protocol_stack.matter.build.c_flags=-mcpu={build.mcu} -mthumb -mfpu=fpv5-sp-d16 -mfloat-abi=hard -c -g {compiler.warning_flags} {build.float_flags} -std=c18 -Wall -Wextra -fdata-sections -ffunction-sections -fomit-frame-pointer -imacros sl_gcc_preinclude.h -imacros sl_openthread_rtos_config.h -Wno-deprecated-declarations -Wno-maybe-uninitialized -Wno-missing-field-initializers -Wno-unused-parameter -Wno-cast-function-type -Wno-sign-compare -Wno-psabi -mcmse --specs=nano.specs -g

nano_matter.menu.protocol_stack.matter.build.cpp_flags=-mcpu={build.mcu} -mthumb -mfpu=fpv5-sp-d16 -mfloat-abi=hard -c -g {compiler.warning_flags} {build.float_flags} -std=gnu++17 -fno-rtti -Wall -Wextra -fno-exceptions -fdata-sections -ffunction-sections -fomit-frame-pointer -imacros sl_gcc_preinclude.h -imacros sl_openthread_rtos_config.h -mcmse -Wno-deprecated-declarations -Wno-maybe-uninitialized -Wno-missing-field-initializers -Wno-unused-parameter -Wno-cast-function-type -Wno-psabi -fno-strict-aliasing -fno-unwind-tables -fno-asynchronous-unwind-tables -fno-common -Wno-sign-compare --specs=nano.specs -g

nano_matter.menu.protocol_stack.matter.build.ld_flags=-mcpu={build.mcu} -mthumb -mfpu=fpv5-sp-d16 -mfloat-abi=hard --specs=nano.specs -Xlinker -Map {compiler.mapfile_path} -Wl,--wrap=MemoryAlloc -Wl,--no-warn-rwx-segment -Wl,--wrap=_free_r -Wl,--wrap=_malloc_r -Wl,--wrap=_calloc_r -Wl,--wrap=_realloc_r -Wl,--gc-sections -Wl,--no-warn-rwx-segments

nano_matter.menu.protocol_stack.matter.build.ld_libs=-lstdc++ -lgcc -lc -lm -lnosys

### Linker files
################
nano_matter.menu.protocol_stack.none.build.ldscript={build.variant.path}/noradio/linkerfile.ld
nano_matter.menu.protocol_stack.ble_arduino.build.ldscript={build.variant.path}/ble_arduino/linkerfile.ld
nano_matter.menu.protocol_stack.ble_silabs.build.ldscript={build.variant.path}/ble_silabs/linkerfile.ld
nano_matter.menu.protocol_stack.matter.build.ldscript={build.variant.path}/matter/linkerfile.ld

### Debug info
################
nano_matter.debug.server.openocd.scripts.0=interface/cmsis-dap.cfg
nano_matter.debug.server.openocd.scripts.1=target/efm32s2_g23.cfg
nano_matter.debug.server=openocd
#nano_matter.debug.svd_file={runtime.platform.path}/svd/MGM240SD22VNA.svd

nano_matter.debug.cortex-debug.custom.postAttachCommands.0=monitor reset halt
#nano_matter.debug.cortex-debug.custom.postAttachCommands.1=monitor reset_config srst_nogate
#nano_matter.debug.cortex-debug.custom.postAttachCommands.2=monitor gdb_breakpoint_override hard
nano_matter.debug.cortex-debug.custom.postAttachCommands.3=monitor gdb_sync
nano_matter.debug.cortex-debug.custom.postAttachCommands.4=c
nano_matter.debug.cortex-debug.custom.overrideRestartCommands.0=monitor reset halt
nano_matter.debug.cortex-debug.custom.overrideRestartCommands.1=monitor gdb_sync
nano_matter.debug.cortex-debug.custom.overrideRestartCommands.2=c
nano_matter.debug.cortex-debug.custom.request=attach


############################
# SparkFun Thing Plus Matter
# OPN: brd2704a
############################

thingplusmatter.name=SparkFun Thing Plus Matter
thingplusmatter.menu.protocol_stack.matter=Matter
thingplusmatter.menu.protocol_stack.ble_arduino=BLE (Arduino)
thingplusmatter.menu.protocol_stack.ble_silabs=BLE (Silabs)
thingplusmatter.menu.protocol_stack.none=None
thingplusmatter.upload.tool=simplicitycommander
thingplusmatter.upload.tool.default=simplicitycommander
thingplusmatter.upload.target=sparkfunthingplus
thingplusmatter.upload.maximum_data_size=262144
thingplusmatter.upload.maximum_size=1572864
thingplusmatter.upload.protocol=jlink
thingplusmatter.upload.setup_command=
thingplusmatter.upload.use_1200bps_touch=false
thingplusmatter.upload.wait_for_upload_port=false
thingplusmatter.upload.native_usb=false
thingplusmatter.bootloader.tool=simplicitycommander
thingplusmatter.bootloader.tool.default=simplicitycommander
thingplusmatter.bootloader.file=sparkfun-thingplus-matter-bootloader-storage-internal-single-512k.hex
thingplusmatter.build.mcu=cortex-m33
thingplusmatter.build.f_cpu=39000000
thingplusmatter.build.board=SILABS_THINGPLUSMATTER
thingplusmatter.build.platform=GECKO
thingplusmatter.build.core=gecko
thingplusmatter.build.variant=thingplusmatter
thingplusmatter.build.variant_system_lib=
thingplusmatter.debug.server=jlink

thingplusmatter.menu.protocol_stack.matter.gsdk_folder=simplicity_sdk_2024.12.1
thingplusmatter.menu.protocol_stack.matter.matter_sdk_folder=matter_2.5.1
thingplusmatter.menu.protocol_stack.matter.build.gsdk_path={build.variant.path}/matter/{gsdk_folder}
thingplusmatter.menu.protocol_stack.matter.build.matter_sdk_path={build.variant.path}/matter/{matter_sdk_folder}
thingplusmatter.menu.protocol_stack.matter.build.precompiled_gsdk="{build.variant.path}/matter/gsdk.a"
thingplusmatter.menu.protocol_stack.ble_arduino.build.precompiled_gsdk="{build.variant.path}/ble_arduino/gsdk.a"
thingplusmatter.menu.protocol_stack.ble_silabs.build.precompiled_gsdk="{build.variant.path}/ble_silabs/gsdk.a"
thingplusmatter.menu.protocol_stack.none.build.precompiled_gsdk="{build.variant.path}/noradio/gsdk.a"

thingplusmatter.menu.protocol_stack.ble_arduino.build.include_list="-I{build.variant.path}" "-I{build.variant.path}/ble_arduino/include"
thingplusmatter.menu.protocol_stack.ble_silabs.build.include_list="-I{build.variant.path}" "-I{build.variant.path}/ble_silabs/include"
thingplusmatter.menu.protocol_stack.none.build.include_list="-I{build.variant.path}" "-I{build.variant.path}/noradio/include"

