SiliconLabs/arduino/boards.txt
thingplusmatter.menu.protocol_stack.none.build.ld_libs=-lstdc++ -lgcc -lc -lm -lnosys -lsupc++

### BLE (Arduino) build flags
#############################
thingplusmatter.menu.protocol_stack.ble_arduino.build.c_flags=-mcpu={build.mcu} -mthumb -mfpu=fpv5-sp-d16 -mfloat-abi=hard -c -g {compiler.warning_flags} {build.float_flags} -std=c18 -Wall -Wextra -fdata-sections -ffunction-sections -fomit-frame-pointer -imacros sl_gcc_preinclude.h -mcmse --specs=nano.specs -g

thingplusmatter.menu.protocol_stack.ble_arduino.build.cpp_flags=-mcpu={build.mcu} -mthumb -mfpu=fpv5-sp-d16 -mfloat-abi=hard -c -g {compiler.warning_flags} {build.float_flags} -std=gnu++17 -Wall -Wextra -fdata-sections -ffunction-sections -fomit-frame-pointer -imacros sl_gcc_preinclude.h -mcmse --specs=nano.specs -g

thingplusmatter.menu.protocol_stack.ble_arduino.build.ld_flags=-mcpu={build.mcu} -mthumb -mfpu=fpv5-sp-d16 -mfloat-abi=hard --specs=nano.specs -Xlinker -Map {compiler.mapfile_path} -Wl,--gc-sections -Wl,--wrap=_free_r -Wl,--wrap=_malloc_r -Wl,--wrap=_calloc_r -Wl,--wrap=_realloc_r

thingplusmatter.menu.protocol_stack.ble_arduino.build.ld_libs=-lstdc++ -lgcc -lc -lm -lnosys -lsupc++

### BLE (Silabs) build flags
############################
thingplusmatter.menu.protocol_stack.ble_silabs.build.c_flags=-mcpu={build.mcu} -mthumb -mfpu=fpv5-sp-d16 -mfloat-abi=hard -c -g {compiler.warning_flags} {build.float_flags} -std=c18 -Wall -Wextra -fdata-sections -ffunction-sections -fomit-frame-pointer -imacros sl_gcc_preinclude.h -mcmse --specs=nano.specs -g

thingplusmatter.menu.protocol_stack.ble_silabs.build.cpp_flags=-mcpu={build.mcu} -mthumb -mfpu=fpv5-sp-d16 -mfloat-abi=hard -c -g {compiler.warning_flags} {build.float_flags} -std=gnu++17 -Wall -Wextra -fdata-sections -ffunction-sections -fomit-frame-pointer -imacros sl_gcc_preinclude.h -mcmse --specs=nano.specs -g

thingplusmatter.menu.protocol_stack.ble_silabs.build.ld_flags=-mcpu={build.mcu} -mthumb -mfpu=fpv5-sp-d16 -mfloat-abi=hard --specs=nano.specs -Xlinker -Map {compiler.mapfile_path} -Wl,--gc-sections -Wl,--wrap=_free_r -Wl,--wrap=_malloc_r -Wl,--wrap=_calloc_r -Wl,--wrap=_realloc_r -flto=auto

thingplusmatter.menu.protocol_stack.ble_silabs.build.ld_libs=-lstdc++ -lgcc -lc -lm -lnosys -lsupc++

### Matter build flags
######################
thingplusmatter.menu.protocol_stack.matter.build.c_flags=-mcpu={build.mcu} -mthumb -mfpu=fpv5-sp-d16 -mfloat-abi=hard -c -g {compiler.warning_flags} {build.float_flags} -std=c18 -Wall -Wextra -fdata-sections -ffunction-sections -fomit-frame-pointer -imacros sl_gcc_preinclude.h -Wno-deprecated-declarations -Wno-maybe-uninitialized -Wno-missing-field-initializers -Wno-unused-parameter -Wno-cast-function-type -Wno-sign-compare -Wno-psabi -mcmse --specs=nano.specs -g

thingplusmatter.menu.protocol_stack.matter.build.cpp_flags=-mcpu={build.mcu} -mthumb -mfpu=fpv5-sp-d16 -mfloat-abi=hard -c -g {compiler.warning_flags} {build.float_flags} -std=gnu++17 -fno-rtti -Wall -Wextra -fno-exceptions -fdata-sections -ffunction-sections -fomit-frame-pointer -imacros sl_gcc_preinclude.h -mcmse -Wno-deprecated-declarations -Wno-maybe-uninitialized -Wno-missing-field-initializers -Wno-unused-parameter -Wno-cast-function-type -Wno-psabi -fno-strict-aliasing -fno-unwind-tables -fno-asynchronous-unwind-tables -fno-common -Wno-sign-compare --specs=nano.specs -g

thingplusmatter.menu.protocol_stack.matter.build.ld_flags=-mcpu={build.mcu} -mthumb -mfpu=fpv5-sp-d16 -mfloat-abi=hard --specs=nano.specs -Xlinker -Map {compiler.mapfile_path} -Wl,--wrap=MemoryAlloc -Wl,--no-warn-rwx-segment -Wl,--wrap=_free_r -Wl,--wrap=_malloc_r -Wl,--wrap=_calloc_r -Wl,--wrap=_realloc_r -Wl,--gc-sections -Wl,--no-warn-rwx-segments

thingplusmatter.menu.protocol_stack.matter.build.ld_libs=-lstdc++ -lgcc -lc -lm -lnosys

### Linker files
################
thingplusmatter.menu.protocol_stack.none.build.ldscript={build.variant.path}/noradio/linkerfile.ld
thingplusmatter.menu.protocol_stack.ble_arduino.build.ldscript={build.variant.path}/ble_arduino/linkerfile.ld
thingplusmatter.menu.protocol_stack.ble_silabs.build.ldscript={build.variant.path}/ble_silabs/linkerfile.ld
thingplusmatter.menu.protocol_stack.matter.build.ldscript={build.variant.path}/matter/linkerfile.ld


################################
# Silicon Labs xG24 Explorer Kit
# OPN: brd2703a
################################

xg24explorerkit.name=Silicon Labs xG24 Explorer Kit
xg24explorerkit.menu.protocol_stack.matter=Matter
xg24explorerkit.menu.protocol_stack.ble_arduino=BLE (Arduino)
xg24explorerkit.menu.protocol_stack.ble_silabs=BLE (Silabs)
xg24explorerkit.menu.protocol_stack.none=None
xg24explorerkit.upload.tool=simplicitycommander
xg24explorerkit.upload.tool.default=simplicitycommander
xg24explorerkit.upload.target=xg24explorerkit
xg24explorerkit.upload.maximum_data_size=262144
xg24explorerkit.upload.maximum_size=1572864
xg24explorerkit.upload.protocol=jlink
xg24explorerkit.upload.setup_command=
xg24explorerkit.upload.use_1200bps_touch=false
xg24explorerkit.upload.wait_for_upload_port=false
xg24explorerkit.upload.native_usb=false
xg24explorerkit.bootloader.tool=simplicitycommander
xg24explorerkit.bootloader.tool.default=simplicitycommander
xg24explorerkit.bootloader.file=xg24-explorer-kit-bootloader-storage-internal-single-512k.hex
xg24explorerkit.build.mcu=cortex-m33
xg24explorerkit.build.f_cpu=78000000
xg24explorerkit.build.board=SILABS_XG24EXPLORERKIT
xg24explorerkit.build.platform=GECKO
xg24explorerkit.build.core=gecko
xg24explorerkit.build.variant=xg24explorerkit
xg24explorerkit.build.variant_system_lib=
xg24explorerkit.debug.server=jlink

xg24explorerkit.build.gsdk_path=
xg24explorerkit.menu.protocol_stack.matter.gsdk_folder=simplicity_sdk_2024.12.1
xg24explorerkit.menu.protocol_stack.matter.matter_sdk_folder=matter_2.5.1
xg24explorerkit.menu.protocol_stack.matter.build.gsdk_path={build.variant.path}/matter/{gsdk_folder}
xg24explorerkit.menu.protocol_stack.matter.build.matter_sdk_path={build.variant.path}/matter/{matter_sdk_folder}
xg24explorerkit.menu.protocol_stack.matter.build.precompiled_gsdk="{build.variant.path}/matter/gsdk.a"
xg24explorerkit.menu.protocol_stack.ble_arduino.build.precompiled_gsdk="{build.variant.path}/ble_arduino/gsdk.a"
xg24explorerkit.menu.protocol_stack.ble_silabs.build.precompiled_gsdk="{build.variant.path}/ble_silabs/gsdk.a"
xg24explorerkit.menu.protocol_stack.none.build.precompiled_gsdk="{build.variant.path}/noradio/gsdk.a"

