SiliconLabs/arduino/boards.txt
xg24explorerkit.build.board_specific_macros='-DNUM_LEDS=2' '-DNUM_BTN=2' '-DNUM_HW_SERIAL=2' '-DNUM_HW_SPI=2' '-DNUM_HW_I2C=2' '-DNUM_DAC_HW=1' '-DARDUINO_MAIN_TASK_STACK_SIZE=2048'

xg24explorerkit.menu.protocol_stack.none.build.extra_flags={build.board_specific_macros} '-DARDUINO_SILABS_STACK_NONE' '-DARDUINO_SILABS_AIML_CAPABLE' '-DEFR32MG24B210F1536IM48=1' '-DSL_APP_PROPERTIES=1' '-DHARDWARE_BOARD_DEFAULT_RF_BAND_2400=1' '-DHARDWARE_BOARD_SUPPORTS_1_RF_BAND=1' '-DHARDWARE_BOARD_SUPPORTS_RF_BAND_2400=1' '-DHFXO_FREQ=39000000' '-DSL_BOARD_NAME="BRD2703A"' '-DSL_BOARD_REV="A02"' '-DconfigNUM_SDK_THREAD_LOCAL_STORAGE_POINTERS=2' '-DSL_COMPONENT_CATALOG_PRESENT=1' '-DMBEDTLS_CONFIG_FILE=<sl_mbedtls_config.h>' '-DMBEDTLS_PSA_CRYPTO_CONFIG_FILE=<psa_crypto_config.h>' '-DTF_LITE_STATIC_MEMORY=1'

xg24explorerkit.menu.protocol_stack.ble_arduino.build.extra_flags={build.board_specific_macros} '-DARDUINO_SILABS_STACK_BLE_ARDUINO' '-DARDUINO_SILABS_AIML_CAPABLE' '-DEFR32MG24B210F1536IM48=1' '-DSL_APP_PROPERTIES=1' '-DHARDWARE_BOARD_DEFAULT_RF_BAND_2400=1' '-DHARDWARE_BOARD_SUPPORTS_1_RF_BAND=1' '-DHARDWARE_BOARD_SUPPORTS_RF_BAND_2400=1' '-DHFXO_FREQ=39000000' '-DSL_BOARD_NAME="BRD2703A"' '-DSL_BOARD_REV="A02"' '-DconfigNUM_SDK_THREAD_LOCAL_STORAGE_POINTERS=2' '-DSL_COMPONENT_CATALOG_PRESENT=1' '-DMBEDTLS_CONFIG_FILE=<sl_mbedtls_config.h>' '-DMBEDTLS_PSA_CRYPTO_CONFIG_FILE=<psa_crypto_config.h>' '-DTF_LITE_STATIC_MEMORY=1'

xg24explorerkit.menu.protocol_stack.ble_silabs.build.extra_flags={build.board_specific_macros} '-DARDUINO_SILABS_STACK_BLE_SILABS' '-DARDUINO_SILABS_AIML_CAPABLE' '-DEFR32MG24B210F1536IM48=1' '-DSL_APP_PROPERTIES=1' '-DHARDWARE_BOARD_DEFAULT_RF_BAND_2400=1' '-DHARDWARE_BOARD_SUPPORTS_1_RF_BAND=1' '-DHARDWARE_BOARD_SUPPORTS_RF_BAND_2400=1' '-DSL_BOARD_NAME="BRD2703A"' '-DSL_BOARD_REV="A02"' '-DconfigNUM_SDK_THREAD_LOCAL_STORAGE_POINTERS=2' '-DSL_COMPONENT_CATALOG_PRESENT=1' '-DMBEDTLS_CONFIG_FILE=<sl_mbedtls_config.h>' '-DMBEDTLS_PSA_CRYPTO_CONFIG_FILE=<psa_crypto_config.h>' '-DSL_RAIL_LIB_MULTIPROTOCOL_SUPPORT=0' '-DSL_RAIL_UTIL_PA_CONFIG_HEADER=<sl_rail_util_pa_config.h>' '-DSLI_RADIOAES_REQUIRES_MASKING=1' '-DTF_LITE_STATIC_MEMORY=1'

xg24explorerkit.menu.protocol_stack.matter.build.extra_flags={build.board_specific_macros} '-DARDUINO_MATTER' '-DARDUINO_MATTER_OVER_THREAD' '-DARDUINO_SILABS_STACK_MATTER_OVER_THREAD' '-DARDUINO_SILABS_AIML_CAPABLE' '-DIS_DEMO_LIGHT=1' '-DNVM3_DEFAULT_MAX_OBJECT_SIZE=4092' '-DNVM3_DEFAULT_NVM_SIZE=40960' '-D_WANT_REENT_SMALL=1' '-DCHIP_ADDRESS_RESOLVE_IMPL_INCLUDE_HEADER=<lib/address_resolve/AddressResolve_DefaultImpl.h>' '-DCHIP_HAVE_CONFIG_H=1' '-DRADIO_CONFIG_DMP_SUPPORT=1' '-DCURRENT_TIME_NOT_IMPLEMENTED=1' '-DMBEDTLS_USER_CONFIG_FILE=<sli_psa_builtin_config.h>' '-DOPENTHREAD_CONFIG_DETERMINISTIC_ECDSA_ENABLE=0' '-DOPENTHREAD_CONFIG_ENABLE_BUILTIN_MBEDTLS=0' '-DNON_SPEC_COMPLIANT_OTA_ACTION_DELAY_FLOOR=-1' '-DSILABS_OTA_ENABLED=1' '-DRTT_USE_ASM=0' '-DENABLE_CHIP_SHELL=1' '-DOPENTHREAD_CONFIG_CLI_PROMPT_ENABLE=0' '-DOPENTHREAD_CONFIG_CLI_TRANSPORT=OT_CLI_TRANSPORT_CONSOLE' '-DSL_MATTER_CLI_ARG_PARSER=1' '-DCHIP_DEVICE_CONFIG_THREAD_ENABLE_CLI=1' '-DCONFIG_ENABLE_EUART=1' '-DEFR32MG24=1' '-DENABLE_WSTK_LEDS=1' '-DEFR32MG24B210F1536IM48=1' '-DSL_APP_PROPERTIES=1' '-DHARDWARE_BOARD_DEFAULT_RF_BAND_2400=1' '-DHARDWARE_BOARD_SUPPORTS_1_RF_BAND=1' '-DHARDWARE_BOARD_SUPPORTS_RF_BAND_2400=1' '-DHFXO_FREQ=39000000' '-DSL_BOARD_NAME="BRD2703A"' '-DSL_BOARD_REV="A02"' '-DconfigNUM_SDK_THREAD_LOCAL_STORAGE_POINTERS=2' '-DSL_COMPONENT_CATALOG_PRESENT=1' '-DSL_CODE_COMPONENT_PERIPHERAL_SYSRTC=hal_sysrtc' '-DCMSIS_NVIC_VIRTUAL=1' '-DCMSIS_NVIC_VIRTUAL_HEADER_FILE="cmsis_nvic_virtual.h"' '-DMBEDTLS_CONFIG_FILE=<sl_mbedtls_config.h>' '-DSL_MEMORY_POOL_LIGHT=1' '-DOPENTHREAD_CORE_CONFIG_PLATFORM_CHECK_FILE="openthread-core-efr32-config-check.h"' '-DOPENTHREAD_PROJECT_CORE_CONFIG_FILE="openthread-core-efr32-config.h"' '-DSL_CODE_COMPONENT_OT_PLATFORM_ABSTRACTION=ot_platform_abstraction' '-DOPENTHREAD_CONFIG_FILE="sl_openthread_generic_config.h"' '-DOPENTHREAD_FTD=1' '-DSL_OPENTHREAD_STACK_FEATURES_CONFIG_FILE="sl_openthread_features_config.h"' '-DSL_CODE_COMPONENT_POWER_MANAGER=power_manager' '-DMBEDTLS_PSA_CRYPTO_CONFIG_FILE=<psa_crypto_config.h>' '-DSL_RAIL_LIB_MULTIPROTOCOL_SUPPORT=1' '-DSL_RAIL_UTIL_PA_CONFIG_HEADER=<sl_rail_util_pa_config.h>' '-DCIRCULAR_QUEUE_USE_LOCAL_CONFIG_HEADER=1' '-DSL_CODE_COMPONENT_CORE=core' '-DSL_OPENTHREAD_CUSTOM_CLI_ENABLE=1' '-DSL_CODE_COMPONENT_SLEEPTIMER=sleeptimer' '-DSLI_RADIOAES_REQUIRES_MASKING=1' '-DTF_LITE_STATIC_MEMORY=1'

xg24explorerkit.build.float_flags=

xg24explorerkit.build.s_flags=-mcpu={build.mcu} -mthumb -mfpu=fpv5-sp-d16 -mfloat-abi=hard -imacros sl_gcc_preinclude.h -x assembler-with-cpp -c -g

### Radioless build flags
#########################
xg24explorerkit.menu.protocol_stack.none.build.c_flags=-mcpu={build.mcu} -mthumb -mfpu=fpv5-sp-d16 -mfloat-abi=hard -c -g {compiler.warning_flags} {build.float_flags} -std=c18 -Wall -Wextra -fdata-sections -ffunction-sections -fomit-frame-pointer -imacros sl_gcc_preinclude.h -mcmse --specs=nano.specs -g -Wno-unused-parameter

xg24explorerkit.menu.protocol_stack.none.build.cpp_flags=-mcpu={build.mcu} -mthumb -mfpu=fpv5-sp-d16 -mfloat-abi=hard -c -g {compiler.warning_flags} {build.float_flags} -std=gnu++17 -Wall -Wextra -fdata-sections -ffunction-sections -fomit-frame-pointer -imacros sl_gcc_preinclude.h -mcmse --specs=nano.specs -g -fno-exceptions -Wno-unused-parameter

xg24explorerkit.menu.protocol_stack.none.build.ld_flags=-mcpu={build.mcu} -mthumb -mfpu=fpv5-sp-d16 -mfloat-abi=hard --specs=nano.specs -Xlinker -Map {compiler.mapfile_path} -Wl,--gc-sections -Wl,--wrap=_free_r -Wl,--wrap=_malloc_r -Wl,--wrap=_calloc_r -Wl,--wrap=_realloc_r

xg24explorerkit.menu.protocol_stack.none.build.ld_libs=-lstdc++ -lgcc -lc -lm -lnosys -lsupc++

### BLE (Arduino) build flags
#############################
xg24explorerkit.menu.protocol_stack.ble_arduino.build.c_flags=-mcpu={build.mcu} -mthumb -mfpu=fpv5-sp-d16 -mfloat-abi=hard -c -g {compiler.warning_flags} {build.float_flags} -std=c18 -Wall -Wextra -fdata-sections -ffunction-sections -fomit-frame-pointer -imacros sl_gcc_preinclude.h -mcmse --specs=nano.specs -g -Wno-unused-parameter

xg24explorerkit.menu.protocol_stack.ble_arduino.build.cpp_flags=-mcpu={build.mcu} -mthumb -mfpu=fpv5-sp-d16 -mfloat-abi=hard -c -g {compiler.warning_flags} {build.float_flags} -std=gnu++17 -Wall -Wextra -fdata-sections -ffunction-sections -fomit-frame-pointer -imacros sl_gcc_preinclude.h -mcmse --specs=nano.specs -g -fno-exceptions -Wno-unused-parameter

xg24explorerkit.menu.protocol_stack.ble_arduino.build.ld_flags=-mcpu={build.mcu} -mthumb -mfpu=fpv5-sp-d16 -mfloat-abi=hard --specs=nano.specs -Xlinker -Map {compiler.mapfile_path} -Wl,--gc-sections -Wl,--wrap=_free_r -Wl,--wrap=_malloc_r -Wl,--wrap=_calloc_r -Wl,--wrap=_realloc_r

xg24explorerkit.menu.protocol_stack.ble_arduino.build.ld_libs=-lstdc++ -lgcc -lc -lm -lnosys -lsupc++

