SiliconLabs/arduino/boards.txt
### BLE (Silabs) build flags
############################
xg24explorerkit.menu.protocol_stack.ble_silabs.build.c_flags=-mcpu={build.mcu} -mthumb -mfpu=fpv5-sp-d16 -mfloat-abi=hard -c -g {compiler.warning_flags} {build.float_flags} -std=c18 -Wall -Wextra -fdata-sections -ffunction-sections -fomit-frame-pointer -imacros sl_gcc_preinclude.h -mcmse --specs=nano.specs -g -Wno-unused-parameter

xg24explorerkit.menu.protocol_stack.ble_silabs.build.cpp_flags=-mcpu={build.mcu} -mthumb -mfpu=fpv5-sp-d16 -mfloat-abi=hard -c -g {compiler.warning_flags} {build.float_flags} -std=gnu++17 -Wall -Wextra -fdata-sections -ffunction-sections -fomit-frame-pointer -imacros sl_gcc_preinclude.h -mcmse --specs=nano.specs -g -fno-exceptions -Wno-unused-parameter

xg24explorerkit.menu.protocol_stack.ble_silabs.build.ld_flags=-mcpu={build.mcu} -mthumb -mfpu=fpv5-sp-d16 -mfloat-abi=hard --specs=nano.specs -Xlinker -Map {compiler.mapfile_path} -Wl,--gc-sections -Wl,--wrap=_free_r -Wl,--wrap=_malloc_r -Wl,--wrap=_calloc_r -Wl,--wrap=_realloc_r -flto=auto

xg24explorerkit.menu.protocol_stack.ble_silabs.build.ld_libs=-lstdc++ -lgcc -lc -lm -lnosys -lsupc++

### Matter build flags
######################
xg24explorerkit.menu.protocol_stack.matter.build.c_flags=-mcpu={build.mcu} -mthumb -mfpu=fpv5-sp-d16 -mfloat-abi=hard -c -g {compiler.warning_flags} {build.float_flags} -std=c18 -Wall -Wextra -fdata-sections -ffunction-sections -fomit-frame-pointer -imacros sl_gcc_preinclude.h -imacros sl_openthread_rtos_config.h -Wno-deprecated-declarations -Wno-maybe-uninitialized -Wno-missing-field-initializers -Wno-unused-parameter -Wno-cast-function-type -Wno-sign-compare -Wno-psabi -mcmse --specs=nano.specs -g

xg24explorerkit.menu.protocol_stack.matter.build.cpp_flags=-mcpu={build.mcu} -mthumb -mfpu=fpv5-sp-d16 -mfloat-abi=hard -c -g {compiler.warning_flags} {build.float_flags} -std=gnu++17 -fno-rtti -Wall -Wextra -fno-exceptions -fdata-sections -ffunction-sections -fomit-frame-pointer -imacros sl_gcc_preinclude.h -imacros sl_openthread_rtos_config.h -mcmse -Wno-deprecated-declarations -Wno-maybe-uninitialized -Wno-missing-field-initializers -Wno-unused-parameter -Wno-cast-function-type -Wno-psabi -fno-strict-aliasing -fno-unwind-tables -fno-asynchronous-unwind-tables -fno-common -Wno-sign-compare --specs=nano.specs -g

xg24explorerkit.menu.protocol_stack.matter.build.ld_flags=-mcpu={build.mcu} -mthumb -mfpu=fpv5-sp-d16 -mfloat-abi=hard --specs=nano.specs -Xlinker -Map {compiler.mapfile_path} -Wl,--wrap=MemoryAlloc -Wl,--no-warn-rwx-segment -Wl,--wrap=_free_r -Wl,--wrap=_malloc_r -Wl,--wrap=_calloc_r -Wl,--wrap=_realloc_r -Wl,--gc-sections -Wl,--no-warn-rwx-segments

xg24explorerkit.menu.protocol_stack.matter.build.ld_libs=-lstdc++ -lgcc -lc -lm -lnosys

### Linker files
################
xg24explorerkit.menu.protocol_stack.none.build.ldscript={build.variant.path}/noradio/linkerfile.ld
xg24explorerkit.menu.protocol_stack.ble_arduino.build.ldscript={build.variant.path}/ble_arduino/linkerfile.ld
xg24explorerkit.menu.protocol_stack.ble_silabs.build.ldscript={build.variant.path}/ble_silabs/linkerfile.ld
xg24explorerkit.menu.protocol_stack.matter.build.ldscript={build.variant.path}/matter/autogen/linkerfile.ld


###########################
# Silicon Labs xG24 Dev Kit
# OPN: brd2601b
###########################

xg24devkit.name=Silicon Labs xG24 Dev Kit
xg24devkit.menu.protocol_stack.matter=Matter
xg24devkit.menu.protocol_stack.ble_arduino=BLE (Arduino)
xg24devkit.menu.protocol_stack.ble_silabs=BLE (Silabs)
xg24devkit.menu.protocol_stack.none=None
xg24devkit.upload.tool=simplicitycommander
xg24devkit.upload.tool.default=simplicitycommander
xg24devkit.upload.target=xg24explorerkit
xg24devkit.upload.maximum_data_size=262144
xg24devkit.upload.maximum_size=1572864
xg24devkit.upload.protocol=jlink
xg24devkit.upload.setup_command=
xg24devkit.upload.use_1200bps_touch=false
xg24devkit.upload.wait_for_upload_port=false
xg24devkit.upload.native_usb=false
xg24devkit.bootloader.tool=simplicitycommander
xg24devkit.bootloader.tool.default=simplicitycommander
xg24devkit.bootloader.file=xg24-dev-kit-bootloader-storage-internal-single-512k.hex
xg24devkit.build.mcu=cortex-m33
xg24devkit.build.f_cpu=78000000
xg24devkit.build.board=SILABS_XG24DEVKIT
xg24devkit.build.platform=GECKO
xg24devkit.build.core=gecko
xg24devkit.build.variant=xg24devkit
xg24devkit.build.variant_system_lib=
xg24devkit.debug.server=jlink

xg24devkit.menu.protocol_stack.matter.gsdk_folder=simplicity_sdk_2024.12.1
xg24devkit.menu.protocol_stack.matter.matter_sdk_folder=matter_2.5.1
xg24devkit.menu.protocol_stack.matter.build.gsdk_path={build.variant.path}/matter/{gsdk_folder}
xg24devkit.menu.protocol_stack.matter.build.matter_sdk_path={build.variant.path}/matter/{matter_sdk_folder}
xg24devkit.menu.protocol_stack.matter.build.precompiled_gsdk="{build.variant.path}/matter/gsdk.a"
xg24devkit.menu.protocol_stack.ble_arduino.build.precompiled_gsdk="{build.variant.path}/ble_arduino/gsdk.a"
xg24devkit.menu.protocol_stack.ble_silabs.build.precompiled_gsdk="{build.variant.path}/ble_silabs/gsdk.a"
xg24devkit.menu.protocol_stack.none.build.precompiled_gsdk="{build.variant.path}/noradio/gsdk.a"

xg24devkit.menu.protocol_stack.ble_arduino.build.include_list="-I{build.variant.path}" "-I{build.variant.path}/ble_arduino/include"
xg24devkit.menu.protocol_stack.ble_silabs.build.include_list="-I{build.variant.path}" "-I{build.variant.path}/ble_silabs/include"
xg24devkit.menu.protocol_stack.none.build.include_list="-I{build.variant.path}" "-I{build.variant.path}/noradio/include"

xg24devkit.menu.protocol_stack.matter.build.include_list="-I{build.variant.path}/matter" "-I{build.variant.path}/matter/autogen" "-I{build.variant.path}/matter/autogen/zap-generated" "-I{build.variant.path}/matter/autogen/zap-generated/app-common/zap-generated" "-I{build.variant.path}/matter/autogen/zap-generated/app-common/zap-generated/attributes" "-I{build.variant.path}/matter/autogen/zap-generated/app-common/zap-generated/ids" "-I{build.variant.path}/matter/autogen/zap-generated/app" "-I{build.variant.path}/matter/autogen/zap-generated/attributes" "-I{build.variant.path}/matter/config" "-I{build.variant.path}/matter/config/app/icd/server" "-I{build.variant.path}/matter/config/matter/tracing" "-I{build.variant.path}/matter/config/btconf" "-I{build.variant.path}/matter/config/app" "-I{build.variant.path}/matter/config/prioconf" "-I{build.variant.path}/matter/config/common" "-I{build.variant.path}/matter/include" "-I{build.matter_sdk_path}/third_party/matter_sdk/examples/platform/silabs" "-I{build.matter_sdk_path}/third_party/matter_sdk/src" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/include" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/lib" "-I{build.matter_sdk_path}/third_party/nlassert/include" "-I{build.matter_sdk_path}/third_party/nlio/include" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/lib/address_resolve" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/app/reporting" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/app" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/app/ember_coupling" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/app/data-model-provider" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/app/codegen-data-model-provider" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/lib/dnssd" "-I{build.matter_sdk_path}/third_party/matter_sdk/examples/platform/silabs/efr32" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/platform/silabs/efr32" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/include/platform" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/include/platform/internal" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/platform/logging" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/include/platform/internal/testing" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/lib/dnssd/platform" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/app/common" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/lwip/silabs" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/platform/silabs" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/platform/silabs/platformAbstraction" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/platform" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/platform/OpenThread" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/platform/FreeRTOS" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/lib/core" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/access" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/access/examples" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/lib/asn1" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/protocols/bdx" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/ble" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/app/server" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/crypto" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/protocols/user_directed_commissioning" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/protocols" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/protocols/secure_channel" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/protocols/echo" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/credentials/examples" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/credentials/attestation_verifier" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/credentials" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/credentials/tests" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/inet" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/protocols/interaction_model" "-I{build.matter_sdk_path}/third_party/matter_sdk/examples/providers" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/messaging" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/transport/raw" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/setup_payload" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/lib/support/logging" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/lib/support" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/lib/support/verhoeff" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/system" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/transport" "-I{build.matter_sdk_path}/third_party/matter_sdk" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/app/icd/server" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/app/clusters/access-control-server" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/app/clusters/basic-information" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/app/cluster-building-blocks" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/app/clusters/color-control-server" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/app/clusters/descriptor" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/app/clusters/diagnostic-logs-server" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/app/clusters/door-lock-server" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/app/clusters/fan-control-server" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/app/clusters/general-commissioning-server" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/app/clusters/general-diagnostics-server" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/app/clusters/groups-server" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/app/clusters/identify-server" "-I{build.matter_sdk_path}/slc/inc" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/app/clusters/level-control" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/app/clusters/network-commissioning" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/app/clusters/occupancy-sensor-server" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/app/clusters/on-off-server" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/controller" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/app/clusters/ota-requestor" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/platform/silabs/provision" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/app/clusters/scenes-server" "-I{build.matter_sdk_path}/slc/component/sdk-content/simplicity-sdk/util/third_party/segger/systemview/SEGGER" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/app/clusters/software-diagnostics-server" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/app/clusters/switch-server" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/app/clusters/thermostat-server" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/app/clusters/thread-network-diagnostics-server" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/tracing" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/platform/silabs/tracing" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/app/MessageDef"

xg24devkit.menu.protocol_stack.none.build.precompiled_libs="{build.variant.path}/noradio/libcmsis-nn.a" "{build.variant.path}/noradio/libtflm.a"

