SiliconLabs/arduino/boards.txt
xg27devkit.menu.protocol_stack.none.build.precompiled_libs=

xg27devkit.menu.protocol_stack.ble_arduino.build.precompiled_libs="{build.variant.path}/ble_arduino/libbgcommon.a" "{build.variant.path}/ble_arduino/liblinklayer.a" "{build.variant.path}/ble_arduino/librail_efr32xg27_gcc_release.a"

xg27devkit.menu.protocol_stack.ble_silabs.build.precompiled_libs="{build.variant.path}/ble_silabs/libbgapi_core.a" "{build.variant.path}/ble_silabs/libbgcommon.a" "{build.variant.path}/ble_silabs/libble_bgapi_gatt_client.a" "{build.variant.path}/ble_silabs/libble_bgapi_gatt_server.a" "{build.variant.path}/ble_silabs/libble_bgapi.a" "{build.variant.path}/ble_silabs/libble_host_accept_list_stub.a" "{build.variant.path}/ble_silabs/libble_host_hal_series2.a" "{build.variant.path}/ble_silabs/libble_host_hci.a" "{build.variant.path}/ble_silabs/libble_host.a" "{build.variant.path}/ble_silabs/libble_system.a" "{build.variant.path}/ble_silabs/libbondingdb.a" "{build.variant.path}/ble_silabs/liblinklayer.a" "{build.variant.path}/ble_silabs/librail_efr32xg27_gcc_release.a"

xg27devkit.build.board_specific_macros='-DNUM_LEDS=1' '-DNUM_BTN=1' '-DNUM_HW_SERIAL=2' '-DNUM_HW_SPI=1' '-DNUM_HW_I2C=1' '-DARDUINO_MAIN_TASK_STACK_SIZE=2048'

xg27devkit.menu.protocol_stack.none.build.extra_flags={build.board_specific_macros} '-DARDUINO_SILABS_STACK_NONE' '-DEFR32BG27C140F768IM40=1' '-DSL_APP_PROPERTIES=1' '-DHARDWARE_BOARD_DEFAULT_RF_BAND_2400=1' '-DHARDWARE_BOARD_SUPPORTS_1_RF_BAND=1' '-DHARDWARE_BOARD_SUPPORTS_RF_BAND_2400=1' '-DHFXO_FREQ=38400000' '-DSL_BOARD_NAME="BRD2602A"' '-DSL_BOARD_REV="A02"' '-DconfigNUM_SDK_THREAD_LOCAL_STORAGE_POINTERS=2' '-DSL_COMPONENT_CATALOG_PRESENT=1' '-DMBEDTLS_CONFIG_FILE=<sl_mbedtls_config.h>' '-DMBEDTLS_PSA_CRYPTO_CONFIG_FILE=<psa_crypto_config.h>'

xg27devkit.menu.protocol_stack.ble_arduino.build.extra_flags={build.board_specific_macros} '-DARDUINO_SILABS_STACK_BLE_ARDUINO' '-DEFR32BG27C140F768IM40=1' '-DSL_APP_PROPERTIES=1' '-DHARDWARE_BOARD_DEFAULT_RF_BAND_2400=1' '-DHARDWARE_BOARD_SUPPORTS_1_RF_BAND=1' '-DHARDWARE_BOARD_SUPPORTS_RF_BAND_2400=1' '-DHFXO_FREQ=38400000' '-DSL_BOARD_NAME="BRD2602A"' '-DSL_BOARD_REV="A02"' '-DconfigNUM_SDK_THREAD_LOCAL_STORAGE_POINTERS=2' '-DSL_COMPONENT_CATALOG_PRESENT=1' '-DMBEDTLS_CONFIG_FILE=<sl_mbedtls_config.h>' '-DMBEDTLS_PSA_CRYPTO_CONFIG_FILE=<psa_crypto_config.h>'

xg27devkit.menu.protocol_stack.ble_silabs.build.extra_flags={build.board_specific_macros} '-DARDUINO_SILABS_STACK_BLE_SILABS' '-DEFR32BG27C140F768IM40=1' '-DSL_APP_PROPERTIES=1' '-DHARDWARE_BOARD_DEFAULT_RF_BAND_2400=1' '-DHARDWARE_BOARD_SUPPORTS_1_RF_BAND=1' '-DHARDWARE_BOARD_SUPPORTS_RF_BAND_2400=1' '-DSL_BOARD_NAME="BRD2602A"' '-DSL_BOARD_REV="A02"' '-DconfigNUM_SDK_THREAD_LOCAL_STORAGE_POINTERS=2' '-DSL_COMPONENT_CATALOG_PRESENT=1' '-DMBEDTLS_CONFIG_FILE=<sl_mbedtls_config.h>' '-DMBEDTLS_PSA_CRYPTO_CONFIG_FILE=<psa_crypto_config.h>' '-DSL_RAIL_LIB_MULTIPROTOCOL_SUPPORT=0' '-DSL_RAIL_UTIL_PA_CONFIG_HEADER=<sl_rail_util_pa_config.h>' '-DSLI_RADIOAES_REQUIRES_MASKING=1'

xg27devkit.build.float_flags=

xg27devkit.build.s_flags=-mcpu={build.mcu} -mthumb -mfpu=fpv5-sp-d16 -mfloat-abi=hard -imacros sl_gcc_preinclude.h -x assembler-with-cpp -c -g

xg27devkit.build.c_flags=-mcpu={build.mcu} -mthumb -mfpu=fpv5-sp-d16 -mfloat-abi=hard -c -g {compiler.warning_flags} {build.float_flags} -std=c18 -Wall -Wextra -fdata-sections -ffunction-sections -fomit-frame-pointer -imacros sl_gcc_preinclude.h -mcmse --specs=nano.specs -g

xg27devkit.build.cpp_flags=-mcpu={build.mcu} -mthumb -mfpu=fpv5-sp-d16 -mfloat-abi=hard -c -g {compiler.warning_flags} {build.float_flags} -std=gnu++17 -Wall -Wextra -fdata-sections -ffunction-sections -fomit-frame-pointer -imacros sl_gcc_preinclude.h -mcmse --specs=nano.specs -g

xg27devkit.build.ld_flags=-mcpu={build.mcu} -mthumb -mfpu=fpv5-sp-d16 -mfloat-abi=hard --specs=nano.specs -Xlinker -Map {compiler.mapfile_path} -Wl,--gc-sections -Wl,--wrap=_free_r -Wl,--wrap=_malloc_r -Wl,--wrap=_calloc_r -Wl,--wrap=_realloc_r -flto=auto

xg27devkit.build.ld_libs=-lstdc++ -lgcc -lc -lm -lnosys -lsupc++

xg27devkit.menu.protocol_stack.none.build.ldscript={build.variant.path}/noradio/linkerfile.ld
xg27devkit.menu.protocol_stack.ble_arduino.build.ldscript={build.variant.path}/ble_arduino/linkerfile.ld
xg27devkit.menu.protocol_stack.ble_silabs.build.ldscript={build.variant.path}/ble_silabs/linkerfile.ld


##################################
# Silicon Labs BGM220 Explorer Kit
# OPN: brd4314a
##################################

bgm220explorerkit.name=Silicon Labs BGM220 Explorer Kit
bgm220explorerkit.menu.protocol_stack.ble_silabs=BLE (Silabs)
bgm220explorerkit.menu.protocol_stack.none=None
bgm220explorerkit.upload.tool=simplicitycommander
bgm220explorerkit.upload.tool.default=simplicitycommander
bgm220explorerkit.upload.target=bgm220explorerkit
bgm220explorerkit.upload.maximum_data_size=32768
bgm220explorerkit.upload.maximum_size=524288
bgm220explorerkit.upload.protocol=jlink
bgm220explorerkit.upload.setup_command=
bgm220explorerkit.upload.use_1200bps_touch=false
bgm220explorerkit.upload.wait_for_upload_port=false
bgm220explorerkit.upload.native_usb=false
bgm220explorerkit.bootloader.tool=simplicitycommander
bgm220explorerkit.bootloader.tool.default=simplicitycommander
bgm220explorerkit.bootloader.file=bgm220-explorer-kit-bootloader-storage-internal-single-512k.hex
bgm220explorerkit.build.mcu=cortex-m33
bgm220explorerkit.build.f_cpu=78000000
bgm220explorerkit.build.board=SILABS_BGM220EXPLORERKIT
bgm220explorerkit.build.platform=GECKO
bgm220explorerkit.build.core=gecko
bgm220explorerkit.build.variant=bgm220explorerkit
bgm220explorerkit.build.variant_system_lib=
bgm220explorerkit.debug.server=jlink

bgm220explorerkit.build.gsdk_path=
bgm220explorerkit.menu.protocol_stack.ble_silabs.build.precompiled_gsdk="{build.variant.path}/ble_silabs/gsdk.a"
bgm220explorerkit.menu.protocol_stack.none.build.precompiled_gsdk="{build.variant.path}/noradio/gsdk.a"

bgm220explorerkit.menu.protocol_stack.ble_silabs.build.include_list="-I{build.variant.path}" "-I{build.variant.path}/ble_silabs/include"
bgm220explorerkit.menu.protocol_stack.none.build.include_list="-I{build.variant.path}" "-I{build.variant.path}/noradio/include"

