SiliconLabs/arduino/boards.txt
bgm220explorerkit.menu.protocol_stack.ble_silabs.build.precompiled_libs="{build.variant.path}/ble_silabs/libbgapi_core.a" "{build.variant.path}/ble_silabs/libbgcommon.a" "{build.variant.path}/ble_silabs/libble_bgapi_gatt_client.a" "{build.variant.path}/ble_silabs/libble_bgapi_gatt_server.a" "{build.variant.path}/ble_silabs/libble_bgapi.a" "{build.variant.path}/ble_silabs/libble_host_accept_list_stub.a" "{build.variant.path}/ble_silabs/libble_host_hal_series2.a" "{build.variant.path}/ble_silabs/libble_host_hci.a" "{build.variant.path}/ble_silabs/libble_host.a" "{build.variant.path}/ble_silabs/libble_system.a" "{build.variant.path}/ble_silabs/libbondingdb.a" "{build.variant.path}/ble_silabs/liblinklayer.a" "{build.variant.path}/ble_silabs/librail_config_bgm220pc22hna_gcc.a" "{build.variant.path}/ble_silabs/librail_module_efr32xg22_gcc_release.a"

bgm220explorerkit.menu.protocol_stack.none.build.precompiled_libs=

bgm220explorerkit.build.board_specific_macros='-DNUM_LEDS=1' '-DNUM_BTN=1' '-DNUM_HW_SERIAL=2' '-DNUM_HW_SPI=1' '-DNUM_HW_I2C=1' '-DARDUINO_MAIN_TASK_STACK_SIZE=256'

bgm220explorerkit.menu.protocol_stack.ble_silabs.build.extra_flags={build.board_specific_macros} '-DARDUINO_SILABS_STACK_BLE_SILABS' '-DBGM220PC22HNA=1' '-DSL_APP_PROPERTIES=1' '-DHARDWARE_BOARD_DEFAULT_RF_BAND_2400=1' '-DHARDWARE_BOARD_SUPPORTS_1_RF_BAND=1' '-DHARDWARE_BOARD_SUPPORTS_RF_BAND_2400=1' '-DSL_BOARD_NAME="BRD4314A"' '-DSL_BOARD_REV="A02"' '-DconfigNUM_SDK_THREAD_LOCAL_STORAGE_POINTERS=2' '-DSL_COMPONENT_CATALOG_PRESENT=1' '-DMBEDTLS_CONFIG_FILE=<sl_mbedtls_config.h>' '-DMBEDTLS_PSA_CRYPTO_CONFIG_FILE=<psa_crypto_config.h>' '-DSL_RAIL_LIB_MULTIPROTOCOL_SUPPORT=0' '-DSL_RAIL_UTIL_PA_CONFIG_HEADER=<sl_rail_util_pa_config.h>' '-DSLI_RADIOAES_REQUIRES_MASKING=1'

bgm220explorerkit.menu.protocol_stack.none.build.extra_flags={build.board_specific_macros} '-DARDUINO_SILABS_STACK_NONE' '-DBGM220PC22HNA=1' '-DSL_APP_PROPERTIES=1' '-DHARDWARE_BOARD_DEFAULT_RF_BAND_2400=1' '-DHARDWARE_BOARD_SUPPORTS_1_RF_BAND=1' '-DHARDWARE_BOARD_SUPPORTS_RF_BAND_2400=1' '-DSL_BOARD_NAME="BRD4314A"' '-DSL_BOARD_REV="A02"' '-DconfigNUM_SDK_THREAD_LOCAL_STORAGE_POINTERS=2' '-DSL_COMPONENT_CATALOG_PRESENT=1' '-DMBEDTLS_CONFIG_FILE=<sl_mbedtls_config.h>' '-DMBEDTLS_PSA_CRYPTO_CONFIG_FILE=<psa_crypto_config.h>'

bgm220explorerkit.build.float_flags=

bgm220explorerkit.build.s_flags=-mcpu={build.mcu} -mthumb -mfpu=fpv5-sp-d16 -mfloat-abi=hard -imacros sl_gcc_preinclude.h -x assembler-with-cpp -c -g

bgm220explorerkit.build.c_flags=-mcpu={build.mcu} -mthumb -mfpu=fpv5-sp-d16 -mfloat-abi=hard -c -g {compiler.warning_flags} {build.float_flags} -std=c18 -Wall -Wextra -fdata-sections -ffunction-sections -fomit-frame-pointer -imacros sl_gcc_preinclude.h -mcmse --specs=nano.specs -g

bgm220explorerkit.build.cpp_flags=-mcpu={build.mcu} -mthumb -mfpu=fpv5-sp-d16 -mfloat-abi=hard -c -g {compiler.warning_flags} {build.float_flags} -std=gnu++17 -Wall -Wextra -fdata-sections -ffunction-sections -fomit-frame-pointer -imacros sl_gcc_preinclude.h -mcmse --specs=nano.specs -g

bgm220explorerkit.build.ld_flags=-mcpu={build.mcu} -mthumb -mfpu=fpv5-sp-d16 -mfloat-abi=hard --specs=nano.specs -Xlinker -Map {compiler.mapfile_path} -Wl,--gc-sections -Wl,--wrap=_free_r -Wl,--wrap=_malloc_r -Wl,--wrap=_calloc_r -Wl,--wrap=_realloc_r -flto=auto

bgm220explorerkit.build.ld_libs=-lstdc++ -lgcc -lc -lm -lnosys -lsupc++

bgm220explorerkit.menu.protocol_stack.ble_silabs.build.ldscript={build.variant.path}/ble_silabs/linkerfile.ld
bgm220explorerkit.menu.protocol_stack.none.build.ldscript={build.variant.path}/noradio/linkerfile.ld


###############################
# Ezurio Lyra 24P 20dBm Dev Kit
# OPN: brd2904a
###############################

lyra24p20.name=Ezurio Lyra 24P 20dBm Dev Kit
lyra24p20.menu.protocol_stack.ble_arduino=BLE (Arduino)
lyra24p20.menu.protocol_stack.ble_silabs=BLE (Silabs)
lyra24p20.menu.protocol_stack.none=None
lyra24p20.upload.tool=simplicitycommander
lyra24p20.upload.tool.default=simplicitycommander
lyra24p20.upload.target=lyra24p20
lyra24p20.upload.maximum_data_size=262144
lyra24p20.upload.maximum_size=1572864
lyra24p20.upload.protocol=jlink
lyra24p20.upload.setup_command=
lyra24p20.upload.use_1200bps_touch=false
lyra24p20.upload.wait_for_upload_port=false
lyra24p20.upload.native_usb=false
lyra24p20.bootloader.tool=simplicitycommander
lyra24p20.bootloader.tool.default=simplicitycommander
lyra24p20.bootloader.file=lyra24p20-bootloader-storage-internal-single-512k.hex
lyra24p20.build.mcu=cortex-m33
lyra24p20.build.f_cpu=78000000
lyra24p20.build.board=EZURIO_LYRA24P20
lyra24p20.build.platform=GECKO
lyra24p20.build.core=gecko
lyra24p20.build.variant=lyra24p20
lyra24p20.build.variant_system_lib=
lyra24p20.debug.server=jlink

lyra24p20.build.gsdk_path=
lyra24p20.menu.protocol_stack.ble_arduino.build.precompiled_gsdk="{build.variant.path}/ble_arduino/gsdk.a"
lyra24p20.menu.protocol_stack.ble_silabs.build.precompiled_gsdk="{build.variant.path}/ble_silabs/gsdk.a"
lyra24p20.menu.protocol_stack.none.build.precompiled_gsdk="{build.variant.path}/noradio/gsdk.a"

lyra24p20.menu.protocol_stack.ble_arduino.build.include_list="-I{build.variant.path}" "-I{build.variant.path}/ble_arduino/include"
lyra24p20.menu.protocol_stack.ble_silabs.build.include_list="-I{build.variant.path}" "-I{build.variant.path}/ble_silabs/include"
lyra24p20.menu.protocol_stack.none.build.include_list="-I{build.variant.path}" "-I{build.variant.path}/noradio/include"

lyra24p20.menu.protocol_stack.none.build.precompiled_libs=

lyra24p20.menu.protocol_stack.ble_arduino.build.precompiled_libs="{build.variant.path}/ble_arduino/libbgcommon.a" "{build.variant.path}/ble_arduino/liblinklayer.a" "{build.variant.path}/ble_arduino/librail_config_bgm240pb32vna_gcc.a" "{build.variant.path}/ble_arduino/librail_module_efr32xg24_gcc_release.a"

lyra24p20.menu.protocol_stack.ble_silabs.build.precompiled_libs="{build.variant.path}/ble_silabs/libbgapi_core.a" "{build.variant.path}/ble_silabs/libbgcommon.a" "{build.variant.path}/ble_silabs/libble_bgapi_gatt_client.a" "{build.variant.path}/ble_silabs/libble_bgapi_gatt_server.a" "{build.variant.path}/ble_silabs/libble_bgapi.a" "{build.variant.path}/ble_silabs/libble_host_accept_list_stub.a" "{build.variant.path}/ble_silabs/libble_host_hal_series2.a" "{build.variant.path}/ble_silabs/libble_host_hci.a" "{build.variant.path}/ble_silabs/libble_host.a" "{build.variant.path}/ble_silabs/libble_system.a" "{build.variant.path}/ble_silabs/libbondingdb.a" "{build.variant.path}/ble_silabs/liblinklayer.a" "{build.variant.path}/ble_arduino/librail_config_bgm240pb32vna_gcc.a" "{build.variant.path}/ble_arduino/librail_module_efr32xg24_gcc_release.a"

lyra24p20.build.board_specific_macros='-DNUM_LEDS=2' '-DNUM_BTN=2' '-DNUM_HW_SERIAL=2' '-DNUM_HW_SPI=2' '-DNUM_HW_I2C=1' '-DNUM_DAC_HW=2' '-DARDUINO_MAIN_TASK_STACK_SIZE=2048'

lyra24p20.menu.protocol_stack.none.build.extra_flags={build.board_specific_macros} '-DARDUINO_SILABS_STACK_NONE' '-DBGM240PB32VNA=1' '-DSL_APP_PROPERTIES=1' '-DHARDWARE_BOARD_DEFAULT_RF_BAND_2400=1' '-DHARDWARE_BOARD_SUPPORTS_1_RF_BAND=1' '-DHARDWARE_BOARD_SUPPORTS_RF_BAND_2400=1' '-DSL_BOARD_NAME="BRD2904A"' '-DSL_BOARD_REV="A00"' '-DconfigNUM_SDK_THREAD_LOCAL_STORAGE_POINTERS=2' '-DSL_COMPONENT_CATALOG_PRESENT=1' '-DMBEDTLS_CONFIG_FILE=<sl_mbedtls_config.h>' '-DMBEDTLS_PSA_CRYPTO_CONFIG_FILE=<psa_crypto_config.h>'

