SiliconLabs/arduino/boards.txt
xiao_mg24.menu.protocol_stack.ble_arduino.build.precompiled_libs="{build.variant.path}/ble_arduino/libbgcommon.a" "{build.variant.path}/ble_arduino/liblinklayer.a" "{build.variant.path}/ble_arduino/librail_efr32xg24_gcc_release.a" "{build.variant.path}/noradio/libcmsis-nn.a" "{build.variant.path}/noradio/libtflm.a"

xiao_mg24.menu.protocol_stack.ble_silabs.build.precompiled_libs="{build.variant.path}/ble_silabs/libbgapi_core.a" "{build.variant.path}/ble_silabs/libbgcommon.a" "{build.variant.path}/ble_silabs/libble_bgapi_gatt_client.a" "{build.variant.path}/ble_silabs/libble_bgapi_gatt_server.a" "{build.variant.path}/ble_silabs/libble_bgapi.a" "{build.variant.path}/ble_silabs/libble_host_accept_list_stub.a" "{build.variant.path}/ble_silabs/libble_host_hal_series2.a" "{build.variant.path}/ble_silabs/libble_host_hci.a" "{build.variant.path}/ble_silabs/libble_host.a" "{build.variant.path}/ble_silabs/libble_system.a" "{build.variant.path}/ble_silabs/libbondingdb.a" "{build.variant.path}/ble_silabs/liblinklayer.a" "{build.variant.path}/ble_silabs/librail_efr32xg24_gcc_release.a" "{build.variant.path}/noradio/libcmsis-nn.a" "{build.variant.path}/noradio/libtflm.a"

xiao_mg24.menu.protocol_stack.matter.build.precompiled_libs="{build.variant.path}/matter/libProvision_efr32mg24.a" "{build.variant.path}/matter/libbgcommon.a" "{build.variant.path}/matter/liblinklayer.a" "{build.variant.path}/matter/libble_bgapi_gatt_server.a" "{build.variant.path}/matter/libbgapi_core.a" "{build.variant.path}/matter/libble_host_accept_list_stub.a" "{build.variant.path}/matter/libble_host.a" "{build.variant.path}/matter/libbondingdb_stub.a" "{build.variant.path}/matter/libble_bgapi.a" "{build.variant.path}/matter/libble_bgapi_stub_gatt_client.a" "{build.variant.path}/matter/libble_host_hal_series2.a" "{build.variant.path}/matter/libble_host_hci.a" "{build.variant.path}/matter/libble_system.a" "{build.variant.path}/matter/libsl_openthread_cm33_gcc.a" "{build.variant.path}/matter/librail_multiprotocol_efr32xg24_gcc_release.a" "{build.variant.path}/noradio/libcmsis-nn.a" "{build.variant.path}/noradio/libtflm.a"

xiao_mg24.build.board_specific_macros='-DARDUINO_XIAO_MG24' '-DNUM_LEDS=1' '-DNUM_HW_SERIAL=2' '-DNUM_HW_SPI=2' '-DNUM_HW_I2C=2' '-DNUM_DAC_HW=2' '-DARDUINO_MAIN_TASK_STACK_SIZE=2048'

xiao_mg24.menu.protocol_stack.none.build.extra_flags={build.board_specific_macros} '-DARDUINO_SILABS_STACK_NONE' '-DARDUINO_SILABS_AIML_CAPABLE' '-DEFR32MG24B220F1536IM48=1' '-DSL_APP_PROPERTIES=1' '-DHARDWARE_BOARD_DEFAULT_RF_BAND_2400=1' '-DHARDWARE_BOARD_SUPPORTS_1_RF_BAND=1' '-DHARDWARE_BOARD_SUPPORTS_RF_BAND_2400=1' '-DHFXO_FREQ=39000000' '-DSL_BOARD_NAME="BRD4187C"' '-DSL_BOARD_REV="A01"' '-DconfigNUM_SDK_THREAD_LOCAL_STORAGE_POINTERS=2' '-DSL_COMPONENT_CATALOG_PRESENT=1' '-DMBEDTLS_CONFIG_FILE=<sl_mbedtls_config.h>' '-DMBEDTLS_PSA_CRYPTO_CONFIG_FILE=<psa_crypto_config.h>' '-DTF_LITE_STATIC_MEMORY=1'

xiao_mg24.menu.protocol_stack.ble_arduino.build.extra_flags={build.board_specific_macros} '-DARDUINO_SILABS_STACK_BLE_ARDUINO' '-DARDUINO_SILABS_AIML_CAPABLE' '-DEFR32MG24B220F1536IM48=1' '-DSL_APP_PROPERTIES=1' '-DHARDWARE_BOARD_DEFAULT_RF_BAND_2400=1' '-DHARDWARE_BOARD_SUPPORTS_1_RF_BAND=1' '-DHARDWARE_BOARD_SUPPORTS_RF_BAND_2400=1' '-DHFXO_FREQ=39000000' '-DSL_BOARD_NAME="BRD4187C"' '-DSL_BOARD_REV="A01"' '-DconfigNUM_SDK_THREAD_LOCAL_STORAGE_POINTERS=2' '-DSL_COMPONENT_CATALOG_PRESENT=1' '-DMBEDTLS_CONFIG_FILE=<sl_mbedtls_config.h>' '-DMBEDTLS_PSA_CRYPTO_CONFIG_FILE=<psa_crypto_config.h>' '-DSL_RAIL_LIB_MULTIPROTOCOL_SUPPORT=0' '-DSL_RAIL_UTIL_PA_CONFIG_HEADER=<sl_rail_util_pa_config.h>' '-DSLI_RADIOAES_REQUIRES_MASKING=1' '-DTF_LITE_STATIC_MEMORY=1'

xiao_mg24.menu.protocol_stack.ble_silabs.build.extra_flags={build.board_specific_macros} '-DARDUINO_SILABS_STACK_BLE_SILABS' '-DARDUINO_SILABS_AIML_CAPABLE' '-DEFR32MG24B220F1536IM48=1' '-DSL_APP_PROPERTIES=1' '-DHARDWARE_BOARD_DEFAULT_RF_BAND_2400=1' '-DHARDWARE_BOARD_SUPPORTS_1_RF_BAND=1' '-DHARDWARE_BOARD_SUPPORTS_RF_BAND_2400=1' '-DHFXO_FREQ=39000000' '-DSL_BOARD_NAME="BRD4187C"' '-DSL_BOARD_REV="A01"' '-DconfigNUM_SDK_THREAD_LOCAL_STORAGE_POINTERS=2' '-DSL_COMPONENT_CATALOG_PRESENT=1' '-DMBEDTLS_CONFIG_FILE=<sl_mbedtls_config.h>' '-DMBEDTLS_PSA_CRYPTO_CONFIG_FILE=<psa_crypto_config.h>' '-DSL_RAIL_LIB_MULTIPROTOCOL_SUPPORT=0' '-DSL_RAIL_UTIL_PA_CONFIG_HEADER=<sl_rail_util_pa_config.h>' '-DSLI_RADIOAES_REQUIRES_MASKING=1' '-DTF_LITE_STATIC_MEMORY=1'

xiao_mg24.menu.protocol_stack.matter.build.extra_flags={build.board_specific_macros} '-DARDUINO_MATTER' '-DARDUINO_MATTER_OVER_THREAD' '-DARDUINO_SILABS_STACK_MATTER_OVER_THREAD' '-DARDUINO_SILABS_AIML_CAPABLE' '-DCHIP_CRYPTO_PLATFORM=1' '-DIS_DEMO_LIGHT=1' '-DNVM3_DEFAULT_MAX_OBJECT_SIZE=4092' '-DNVM3_DEFAULT_NVM_SIZE=40960' '-DSL_STATUS_LED=0' '-D_WANT_REENT_SMALL=1' '-DconfigNUM_THREAD_LOCAL_STORAGE_POINTERS=2' '-DconfigNUM_USER_THREAD_LOCAL_STORAGE_POINTERS=0' '-DCHIP_ADDRESS_RESOLVE_IMPL_INCLUDE_HEADER=<lib/address_resolve/AddressResolve_DefaultImpl.h>' '-DCHIP_HAVE_CONFIG_H=1' '-DRADIO_CONFIG_DMP_SUPPORT=1' '-DCURRENT_TIME_NOT_IMPLEMENTED=1' '-DMBEDTLS_USER_CONFIG_FILE=<sli_psa_builtin_config.h>' '-DOPENTHREAD_CONFIG_DETERMINISTIC_ECDSA_ENABLE=0' '-DOPENTHREAD_CONFIG_ENABLE_BUILTIN_MBEDTLS=0' '-DSILABS_OTA_ENABLED=1' '-DRTT_USE_ASM=0' '-DENABLE_WSTK_LEDS=1' '-DEFR32MG24B220F1536IM48=1' '-DSL_APP_PROPERTIES=1' '-DHARDWARE_BOARD_DEFAULT_RF_BAND_2400=1' '-DHARDWARE_BOARD_SUPPORTS_1_RF_BAND=1' '-DHARDWARE_BOARD_SUPPORTS_RF_BAND_2400=1' '-DHFXO_FREQ=39000000' '-DSL_BOARD_NAME="BRD4187C"' '-DSL_BOARD_REV="A01"' '-DconfigNUM_SDK_THREAD_LOCAL_STORAGE_POINTERS=2' '-DSL_COMPONENT_CATALOG_PRESENT=1' '-DMBEDTLS_CONFIG_FILE=<sl_mbedtls_config.h>' '-DOPENTHREAD_CORE_CONFIG_PLATFORM_CHECK_FILE="openthread-core-efr32-config-check.h"' '-DOPENTHREAD_PROJECT_CORE_CONFIG_FILE="openthread-core-efr32-config.h"' '-DOPENTHREAD_CONFIG_FILE="sl_openthread_generic_config.h"' '-DOPENTHREAD_FTD=1' '-DSL_OPENTHREAD_STACK_FEATURES_CONFIG_FILE="sl_openthread_features_config.h"' '-DMBEDTLS_PSA_CRYPTO_CONFIG_FILE=<psa_crypto_config.h>' '-DSL_RAIL_LIB_MULTIPROTOCOL_SUPPORT=1' '-DSL_RAIL_UTIL_PA_CONFIG_HEADER=<sl_rail_util_pa_config.h>' '-DSLI_RADIOAES_REQUIRES_MASKING=1' '-DTF_LITE_STATIC_MEMORY=1'

xiao_mg24.build.float_flags=

xiao_mg24.build.s_flags=-mcpu={build.mcu} -mthumb -mfpu=fpv5-sp-d16 -mfloat-abi=hard -imacros sl_gcc_preinclude.h -x assembler-with-cpp -c -g

### Radioless build flags
#########################
xiao_mg24.menu.protocol_stack.none.build.c_flags=-mcpu={build.mcu} -mthumb -mfpu=fpv5-sp-d16 -mfloat-abi=hard -c -g {compiler.warning_flags} {build.float_flags} -std=c18 -Wall -Wextra -fdata-sections -ffunction-sections -fomit-frame-pointer -imacros sl_gcc_preinclude.h -mcmse --specs=nano.specs -g -Wno-unused-parameter

xiao_mg24.menu.protocol_stack.none.build.cpp_flags=-mcpu={build.mcu} -mthumb -mfpu=fpv5-sp-d16 -mfloat-abi=hard -c -g {compiler.warning_flags} {build.float_flags} -std=gnu++17 -Wall -Wextra -fdata-sections -ffunction-sections -fomit-frame-pointer -imacros sl_gcc_preinclude.h -mcmse --specs=nano.specs -g -fno-exceptions -Wno-unused-parameter

