SiliconLabs/arduino/boards.txt
xiao_mg24.menu.protocol_stack.none.build.ld_flags=-mcpu={build.mcu} -mthumb -mfpu=fpv5-sp-d16 -mfloat-abi=hard --specs=nano.specs -Xlinker -Map {compiler.mapfile_path} -Wl,--gc-sections -Wl,--wrap=_free_r -Wl,--wrap=_malloc_r -Wl,--wrap=_calloc_r -Wl,--wrap=_realloc_r

xiao_mg24.menu.protocol_stack.none.build.ld_libs=-lstdc++ -lgcc -lc -lm -lnosys -lsupc++

### BLE (Arduino) build flags
#############################
xiao_mg24.menu.protocol_stack.ble_arduino.build.c_flags=-mcpu={build.mcu} -mthumb -mfpu=fpv5-sp-d16 -mfloat-abi=hard -c -g {compiler.warning_flags} {build.float_flags} -std=c18 -Wall -Wextra -fdata-sections -ffunction-sections -fomit-frame-pointer -imacros sl_gcc_preinclude.h -mcmse --specs=nano.specs -g -Wno-unused-parameter

xiao_mg24.menu.protocol_stack.ble_arduino.build.cpp_flags=-mcpu={build.mcu} -mthumb -mfpu=fpv5-sp-d16 -mfloat-abi=hard -c -g {compiler.warning_flags} {build.float_flags} -std=gnu++17 -Wall -Wextra -fdata-sections -ffunction-sections -fomit-frame-pointer -imacros sl_gcc_preinclude.h -mcmse --specs=nano.specs -g -fno-exceptions -Wno-unused-parameter

xiao_mg24.menu.protocol_stack.ble_arduino.build.ld_flags=-mcpu={build.mcu} -mthumb -mfpu=fpv5-sp-d16 -mfloat-abi=hard --specs=nano.specs -Xlinker -Map {compiler.mapfile_path} -Wl,--gc-sections -Wl,--wrap=_free_r -Wl,--wrap=_malloc_r -Wl,--wrap=_calloc_r -Wl,--wrap=_realloc_r

xiao_mg24.menu.protocol_stack.ble_arduino.build.ld_libs=-lstdc++ -lgcc -lc -lm -lnosys -lsupc++

### BLE (Silabs) build flags
############################
xiao_mg24.menu.protocol_stack.ble_silabs.build.c_flags=-mcpu={build.mcu} -mthumb -mfpu=fpv5-sp-d16 -mfloat-abi=hard -c -g {compiler.warning_flags} {build.float_flags} -std=c18 -Wall -Wextra -fdata-sections -ffunction-sections -fomit-frame-pointer -imacros sl_gcc_preinclude.h -mcmse --specs=nano.specs -g -Wno-unused-parameter

xiao_mg24.menu.protocol_stack.ble_silabs.build.cpp_flags=-mcpu={build.mcu} -mthumb -mfpu=fpv5-sp-d16 -mfloat-abi=hard -c -g {compiler.warning_flags} {build.float_flags} -std=gnu++17 -Wall -Wextra -fdata-sections -ffunction-sections -fomit-frame-pointer -imacros sl_gcc_preinclude.h -mcmse --specs=nano.specs -g -fno-exceptions -Wno-unused-parameter

xiao_mg24.menu.protocol_stack.ble_silabs.build.ld_flags=-mcpu={build.mcu} -mthumb -mfpu=fpv5-sp-d16 -mfloat-abi=hard --specs=nano.specs -Xlinker -Map {compiler.mapfile_path} -Wl,--gc-sections -Wl,--wrap=_free_r -Wl,--wrap=_malloc_r -Wl,--wrap=_calloc_r -Wl,--wrap=_realloc_r -flto=auto

xiao_mg24.menu.protocol_stack.ble_silabs.build.ld_libs=-lstdc++ -lgcc -lc -lm -lnosys -lsupc++

### Matter build flags
######################
xiao_mg24.menu.protocol_stack.matter.build.c_flags=-mcpu={build.mcu} -mthumb -mfpu=fpv5-sp-d16 -mfloat-abi=hard -c -g {compiler.warning_flags} {build.float_flags} -std=c18 -Wall -Wextra -fdata-sections -ffunction-sections -fomit-frame-pointer -imacros sl_gcc_preinclude.h -imacros sl_openthread_rtos_config.h -Wno-deprecated-declarations -Wno-maybe-uninitialized -Wno-missing-field-initializers -Wno-unused-parameter -Wno-cast-function-type -Wno-sign-compare -Wno-psabi -mcmse --specs=nano.specs -g

xiao_mg24.menu.protocol_stack.matter.build.cpp_flags=-mcpu={build.mcu} -mthumb -mfpu=fpv5-sp-d16 -mfloat-abi=hard -c -g {compiler.warning_flags} {build.float_flags} -std=gnu++17 -fno-rtti -Wall -Wextra -fno-exceptions -fdata-sections -ffunction-sections -fomit-frame-pointer -imacros sl_gcc_preinclude.h -imacros sl_openthread_rtos_config.h -mcmse -Wno-deprecated-declarations -Wno-maybe-uninitialized -Wno-missing-field-initializers -Wno-unused-parameter -Wno-cast-function-type -Wno-psabi -fno-strict-aliasing -fno-unwind-tables -fno-asynchronous-unwind-tables -fno-common -Wno-sign-compare --specs=nano.specs -g

xiao_mg24.menu.protocol_stack.matter.build.ld_flags=-mcpu={build.mcu} -mthumb -mfpu=fpv5-sp-d16 -mfloat-abi=hard --specs=nano.specs -Xlinker -Map {compiler.mapfile_path} -Wl,--wrap=MemoryAlloc -Wl,--no-warn-rwx-segment -Wl,--wrap=_free_r -Wl,--wrap=_malloc_r -Wl,--wrap=_calloc_r -Wl,--wrap=_realloc_r -Wl,--gc-sections -Wl,--no-warn-rwx-segments

xiao_mg24.menu.protocol_stack.matter.build.ld_libs=-lstdc++ -lgcc -lc -lm -lnosys

### Linker files
################
xiao_mg24.menu.protocol_stack.none.build.ldscript={build.variant.path}/noradio/linkerfile.ld
xiao_mg24.menu.protocol_stack.ble_arduino.build.ldscript={build.variant.path}/ble_arduino/linkerfile.ld
xiao_mg24.menu.protocol_stack.ble_silabs.build.ldscript={build.variant.path}/ble_silabs/linkerfile.ld
xiao_mg24.menu.protocol_stack.matter.build.ldscript={build.variant.path}/matter/linkerfile.ld

### Debug info
################
xiao_mg24.debug.server.openocd.scripts.0=interface/cmsis-dap.cfg
xiao_mg24.debug.server.openocd.scripts.1=target/efm32s2_g23.cfg
xiao_mg24.debug.server=openocd
#xiao_mg24.debug.svd_file={runtime.platform.path}/svd/MGM240SD22VNA.svd

xiao_mg24.debug.cortex-debug.custom.postAttachCommands.0=monitor reset halt
#xiao_mg24.debug.cortex-debug.custom.postAttachCommands.1=monitor reset_config srst_nogate
#xiao_mg24.debug.cortex-debug.custom.postAttachCommands.2=monitor gdb_breakpoint_override hard
xiao_mg24.debug.cortex-debug.custom.postAttachCommands.3=monitor gdb_sync
xiao_mg24.debug.cortex-debug.custom.postAttachCommands.4=c
xiao_mg24.debug.cortex-debug.custom.overrideRestartCommands.0=monitor reset halt
xiao_mg24.debug.cortex-debug.custom.overrideRestartCommands.1=monitor gdb_sync
xiao_mg24.debug.cortex-debug.custom.overrideRestartCommands.2=c
xiao_mg24.debug.cortex-debug.custom.request=attach
